webhooks/testdata/new_dunning_event_notification.xml

<?xml version="1.0" encoding="UTF-8"?>
<new_dunning_event_notification>
   <account>
      <account_code>1</account_code>
      <username>verena</username>
      <email>verena@example.com</email>
      <first_name>Verena</first_name>
      <last_name>Example</last_name>
      <company_name>Company, Inc.</company_name>
      <phone />
   </account>
   <invoice>
      <uuid>424a9d4a2174b4f39bc776426aa19c32</uuid>
      <state>past_due</state>
      <origin type="symbol">renewal</origin>
      <invoice_number_prefix />
      <invoice_number type="integer">1813</invoice_number>
      <address>
         <address1 />
         <address2 />
         <city />
         <state />
         <zip />
         <country />
         <phone />
      </address>
      <vat_number />
      <currency>USD</currency>
      <balance_in_cents type="integer">4000</balance_in_cents>
      <total_in_cents type="integer">4500</total_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <subtotal_in_cents type="integer">4500</subtotal_in_cents>
      <subtotal_before_discount_in_cents type="integer">4500</subtotal_before_discount_in_cents>
      <discount_in_cents type="integer">0</discount_in_cents>
      <subscription_ids type="array">
         <subscription_id>4110792b3b01967d854f674b7282f542</subscription_id>
      </subscription_ids>
      <customer_notes>Thanks for your business!</customer_notes>
      <created_at type="datetime">2018-01-09T16:47:43Z</created_at>
      <updated_at type="datetime">2018-02-12T16:50:23Z</updated_at>
      <closed_at type="datetime" nil="true" />
      <po_number />
      <terms_and_conditions />
      <due_on type="dateTime">2018-02-09T16:47:43Z</due_on>
      <dunning_events_count type="integer">2</dunning_events_count>
      <final_dunning_event type="boolean">false</final_dunning_event>
      <net_terms type="integer">30</net_terms>
      <collection_method>manual</collection_method>
   </invoice>
   <subscription>
      <plan>
         <plan_code>gold</plan_code>
         <name>Gold</name>
      </plan>
      <uuid>4110792b3b01967d854f674b7282f542</uuid>
      <state>active</state>
      <quantity type="integer">1</quantity>
      <total_amount_in_cents type="integer">4500</total_amount_in_cents>
      <subscription_add_ons type="array" />
      <activated_at type="datetime">2017-11-09T16:47:30Z</activated_at>
      <canceled_at type="datetime" nil="true" />
      <expires_at type="datetime" nil="true" />
      <current_period_started_at type="datetime">2018-02-09T16:47:30Z</current_period_started_at>
      <current_period_ends_at type="datetime">2018-03-09T16:47:30Z</current_period_ends_at>
      <trial_started_at type="datetime" nil="true" />
      <trial_ends_at type="datetime" nil="true" />
   </subscription>
</new_dunning_event_notification>